Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The model is based on the https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc[Eclipse MicroProfile LRA specification]. The approach is for the developer to annotate a business method with a Java annotation (https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@LRA`]). When such a method is called, an LRA context is created (if one is not already present) which is passed along with subsequent JAX-RS invocations until a method is reached which also contains an `@LRA` annotation with an attribute that indicates that the LRA should be closed or cancelled. The default is for the LRA to be closed in the same method that started the LRA (which itself may have propagated the context during method execution). The JAX-RS resource indicates that it wishes to participate in the interaction by, minimally, marking one of the methods with an https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Compensate`] annotation. If the context is later cancelled, then this `@Compensate` action is guaranteed to be called even in the presence of failures and is the trigger for the resource to compensate for any activities it performed in the context of the LRA. This guarantee enables services to operate reliably with the assurance of eventual consistency (when all compensation activities have ran to completion). The participant can ask to be reliably notified when the LRA it is participating in is closed by marking one of the methods with an https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Complete`] annotation. In this way cancelling an LRA causes all participants to be notified via their Compensate callback and closing an LRA causes all participants to be notified via their Complete callback (if they have one). Other annotations for controlling participants are documented in the https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[MicroProfile LRA API v1.0 javadoc].
ja_jp: このモデルは、 https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc[Eclipse MicroProfile LRA仕様]に基づいています。このアプローチでは、開発者はビジネス・メソッドにJavaアノテーション( https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@LRA`])をします.このようなメソッドが呼び出されると、LRAコンテキストが作成され（まだ存在していない場合）、後続のJAX-RSの呼び出しとともに、LRAの閉鎖またはキャンセルを示す属性を持つ `@LRA` アノテーションを含むメソッドに到達するまで渡されます。デフォルトでは、LRAを開始したのと同じメソッドでLRAを閉じることになっています（それ自体がメソッド実行中にコンテキストを伝播している可能性があります）。JAX-RSリソースは、メソッドの1つをアノテーションでマークすることで、相互作用への参加を希望することを示します。 https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Compensate`]アノテーションでメソッドの1つをマークすることで、相互作用に参加したいことを示します。コンテキストが後にキャンセルされた場合、この補償アクションは、障害が発生しても呼び出されることが保証されており、リソースがLRAのコンテキストで実行したアクティビティを補償するトリガーとなります。この保証により、最終的な一貫性（すべての補償活動が完了したとき）が保証された状態で、サービスを確実に動作させることができます。参加者は、参加しているLRAが閉じられたときに確実に通知されるようにするために、メソッドの1つに link:https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Complete`]アノテーションを付けることで、参加者は自分が参加しているLRAが終了したときに確実に通知を受けることができます。このように、LRAをキャンセルすると、すべての参加者にCompensateコールバックを介して通知され、LRAをクローズすると、すべての参加者にCompleteコールバック（ある場合）を介して通知されます。参加者を制御するためのその他のアノテーションについては、 https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[MicroProfile LRA API v1.0 javadoc] に記載されています。

source: The model is based on the https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc[Eclipse MicroProfile LRA specification]. The approach is for the developer to annotate a business method with a Java annotation (https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@LRA`]). When such a method is called, an LRA context is created (if one is not already present) which is passed along with subsequent Jakarta REST invocations until a method is reached which also contains an `@LRA` annotation with an attribute that indicates that the LRA should be closed or cancelled. The default is for the LRA to be closed in the same method that started the LRA (which itself may have propagated the context during method execution). The Jakarta REST resource indicates that it wishes to participate in the interaction by, minimally, marking one of the methods with an https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Compensate`] annotation. If the context is later cancelled, then this `@Compensate` action is guaranteed to be called even in the presence of failures and is the trigger for the resource to compensate for any activities it performed in the context of the LRA. This guarantee enables services to operate reliably with the assurance of eventual consistency (when all compensation activities have ran to completion). The participant can ask to be reliably notified when the LRA it is participating in is closed by marking one of the methods with an https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Complete`] annotation. In this way cancelling an LRA causes all participants to be notified via their Compensate callback and closing an LRA causes all participants to be notified via their Complete callback (if they have one). Other annotations for controlling participants are documented in the https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[MicroProfile LRA API v1.0 javadoc].
ja_jp: このモデルは、 https://github.com/eclipse/microprofile-lra/blob/master/spec/src/main/asciidoc/microprofile-lra-spec.asciidoc[Eclipse MicroProfile LRA仕様]に基づいています。 このアプローチは、開発者がビジネスメソッドにJavaアノテーション（https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@LRA`]）を付けるアプローチです。 このようなメソッドが呼び出されると、（まだ存在しない場合）LRA コンテキストが作成され、LRA を閉じるかキャンセルすることを示す属性を持つ `@LRA` アノテーションを含むメソッドに到達するまで、その後の Jakarta REST 呼び出しと一緒に渡されます。デフォルトは、LRA を開始したのと同じメソッド（メソッド実行中にコンテキストを伝播した可能性がある）で LRA がクローズされることです。 Jakarta RESTリソースは、最低限、 https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Compensate`]アノテーションでメソッドの1つをマークすることで、対話に参加したいことを示します。コンテキストが後でキャンセルされた場合、この `@Compensate` アクションは、障害があっても呼び出されることが保証され、リソースが LRA のコンテキストで実行した活動を補償するためのトリガーとなります。この保証により、（すべての補償活動が完了したときに）最終的な整合性が保証され、サービスが確実に動作することができます。参加者は、 https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[`@Complete`]アノテーションでメソッドの1つをマークすることによって、参加しているLRAが終了したときに確実に通知されるように求めることができます。このように、LRAをキャンセルすると、Compensateコールバックを通じてすべての参加者に通知され、LRAを閉じると、Completeコールバックを通じてすべての参加者に通知されます（ある場合）。 参加者をコントロールするためのその他のアノテーションについては、 https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/[MicroProfile LRA API v1.0 javadoc]に記載されています。

source: The monopolization has been explained in the xref:cpu-bound[Virtual threads are useful for I/O-bound workloads only] section. When running long computations, we do not allow the JVM to unmount and switch to another virtual thread until the virtual thread terminates. Indeed, the current scheduler does not support preempting tasks.
ja_jp: 独占については、xref:cpu-bound[仮想スレッドは I/O バウンドのワークロードにのみ有効] のセクションで説明しました。 長い計算を実行する場合、仮想スレッドが終了するまで、JVM がアンマウントして別の仮想スレッドに切り替えることを許可しません。 実際、現在のスケジューラはタスクのプリエンプトをサポートしていません。

source: The more representative your integration tests are of production traffic, the more effective the AOT cache will be.
ja_jp: 統合テストが本番のトラフィックをより忠実に再現しているほど、AOT キャッシュはより効果的になります。

source: The most common case where the difference in providers might result in different behavior, is the included `jakarta.ws.rs.ext.ExceptionMapper` implementations. To see what classes are included in the application, launch the application in dev mode and navigate to http://localhost:8080/q/dev-ui/io.quarkus.quarkus-rest/exception-mappers.
ja_jp: プロバイダーの違いによって動作が異なる可能性がある最も一般的なケースは、同梱の `jakarta.ws.rs.ext.ExceptionMapper` 実装です。アプリケーションに含まれているクラスを確認するには、アプリケーションを開発モードで起動し、 http://localhost:8080/q/dev-ui/io.quarkus.quarkus-rest/exception-mappers に移動します。

source: The most common case where the difference in providers might result in different behavior, is the included `jakarta.ws.rs.ext.ExceptionMapper` implementations. To see what classes are included in the application, launch the application in dev mode and navigate to http://localhost:8080/q/dev-ui/io.quarkus.quarkus-resteasy-reactive/exception-mappers.
ja_jp: プロバイダーの違いによって動作が異なる可能性がある最も一般的なケースは、含まれる `jakarta.ws.rs.ext.ExceptionMapper` の実装です。アプリケーションに含まれるクラスを確認するには、開発モードでアプリケーションを起動し、 http://localhost:8080/q/dev-ui/io.quarkus.quarkus-resteasy-reactive/exception-mappers に移動します。

source: The most common case where the difference in providers might result in different behavior, is the included `jakarta.ws.rs.ext.ExceptionMapper` implementations. To see what classes are included in the application, launch the application in dev mode and navigate to http://localhost:8080/q/dev-ui/quarkus-rest/exception-mappers.
ja_jp: プロバイダの違いによって動作が異なる最も一般的なケースは、 `jakarta.ws.rs.ext.ExceptionMapper` の実装です。アプリケーションに含まれるクラスを確認するには、開発モードでアプリケーションを起動し、 link:http://localhost:8080/q/dev-ui/quarkus-rest/exception-mappers[http://localhost:8080/q/dev-ui/quarkus-rest/exception-mappers] を開いてください。

source: The most common case where the difference in providers might result in different behavior, is the included `javax.ws.rs.ext.ExceptionMapper` implementations. To see what classes are included in the application, launch the application in dev mode and navigate to http://localhost:8080/q/dev/io.quarkus.quarkus-resteasy-reactive/exception-mappers.
ja_jp: プロバイダの違いで動作が異なる可能性がある最も一般的なケースは、同梱の `javax.ws.rs.ext.ExceptionMapper` 実装です。アプリケーションにどのようなクラスが含まれているかを確認するには、開発モードでアプリケーションを起動し、 http://localhost:8080/q/dev/io.quarkus.quarkus-resteasy-reactive/exception-mappers を開いてください。

source: The most common examples of build-time initialized code are static variables and blocks. Although Mandrel executes those at run-time by default, Quarkus instructs Mandrel to run them at build-time for the reasons given.
ja_jp: ビルド時に初期化されるコードの最も一般的な例は、静的変数とブロックです。Mandrelはこれらをデフォルトでは実行時に実行しますが、Quarkusでは先程の理由でビルド時に実行するように指示しています。

source: The most common way to contribute to Dev UI is via Pages from your extension card in the Extension page.
ja_jp: Dev UI に貢献する最も一般的な方法は、エクステンションページにあるエクステンションカードのページを経由することです。

source: The most important attributes are listed in the tables below:
ja_jp: 最も重要な属性を以下の表に記載しています。

source: The most straightforward approach is obviously to inject `QuarkusCqlSession` directly. This should work just fine for most applications; however, the `QuarkusCqlSession` bean needs to be initialized before it can be used, and this process is blocking.
ja_jp: 最も簡単なアプローチは、明らかに `QuarkusCqlSession` を直接注入することです。これは、ほとんどのアプリケーションで問題なく機能するはずですが、 `QuarkusCqlSession` Bean を使用する前に初期化する必要があるため、このプロセスはブロックされています。

source: The most straightforward approach is obviously to inject the bean directly. This should work just fine for most applications. However, the `QuarkusCqlSession` bean, and all DAO beans that depend on it, might take some time to initialize before they can be used for the first time, and this process is blocking.
ja_jp: 最も簡単な方法は、明らかにBeanを直接注入することです。これはほとんどのアプリケーションで問題なく動作するはずです。しかし、 `QuarkusCqlSession` Beanとそれに依存するすべてのDAO Beanは、初めて使用できるようになる前に初期化するのに時間がかかるかもしれませんし、このプロセスはブロッキング操作です。

source: The most up-to-date information on GC logging flags can be obtained by printing the list of flags that can be passed to native executables:
ja_jp: GCロギングフラグについての最新情報は、ネイティブ実行可能ファイルに渡すことができるフラグのリストを表示することで得ることができます:

source: The most visible being a far improvement integration in the Dev UI.
ja_jp: 最も顕著な変更は、Dev UIの統合が大幅に改善されたことです。

source: The most visible change is that the `javax.\*` packages from Jakarta EE have been moved to `jakarta.*`. This change requires changing any source code and dependency and its transitive dependencies that rely on the `javax.*` packages.
ja_jp: 最も目に見える変更点は、Jakarta EE の `javax.\*` パッケージが `jakarta.*` に変更されたことです。この変更には、 `javax.*` パッケージに依存しているソースコードと依存関係、その推移的依存関係の変更が必要です。

source: The mounting rules of the management endpoints slightly differ from the ones used when using the main HTTP server:
ja_jp: マネジメントエンドポイントのマウントルールは、メインのHTTPサーバーを使用する場合と若干異なります:

source: The move to Hibernate ORM 6.2 is a major upgrade. While it brings a lot of improvements and new features, it also includes some breaking changes. In order to help migrate Quarkus apps with Hibernate, we have created a <a href="https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration">Hibernate ORM migration guide</a> to help you through the process.
ja_jp: Hibernate ORM 6.2への移行は、大きなアップグレードです。多くの改善や新機能がもたらされる一方で、いくつかの破壊的な変更も含まれています。Hibernateを使用したQuarkusアプリの移行を支援するために、<a href="https://github.com/quarkusio/quarkus/wiki/Migration-Guide-3.0:-Hibernate-ORM-5-to-6-migration">Hibernate ORM移行ガイド</a>を作成しました。

source: The move to version 1.0 of the A2A specification marks its transition from experimental to production-ready. As the specification matures, we've taken the opportunity to clean up technical debt, modernize our implementation, and establish patterns that will serve us well into the future.
ja_jp: A2A仕様のバージョン1.0への移行は、実験段階から製品対応への移行を示します。仕様が成熟するにつれて、当社は技術的負債を整理し、実装を近代化し、将来にわたって役立つパターンを確立する機会を得ました。

source: The name `QUARKUS_DATASOURCE_PASSWORD` follows the same conversion rules used for <<environment-variables>>.
ja_jp: `QUARKUS_DATASOURCE_PASSWORD` という名前は、 <<environment-variables>> で使われたのと同じ変換ルールに従います。

source: The name `QUARKUS_DATASOURCE_PASSWORD` the same conversion rules used for <<environment-variables>>.
ja_jp: 名前 `QUARKUS_DATASOURCE_PASSWORD` は、<<environment-variables>> に使用されるものと同じ変換ルール。

source: The name `QUARKUS_DATASOURCE_PASSWORD` the same conversion rules used for xref:environment-variables[Environment variables].
ja_jp: `QUARKUS_DATASOURCE_PASSWORD` という名前。 xref:environment-variables[環境変数] に使われるのと同じ変換ルールです。

source: The name can also be explicitly specified by giving a `name` attribute to the `@ConfigItem` annotation.
ja_jp: 名前は、 `@ConfigItem` アノテーションに `name` 属性を与えることによって明示的に指定することもできます。

source: The name of the AMQP Client Option bean used to customize the AMQP client configuration Type: _string_
ja_jp: AMQP クライアント設定をカスタマイズするために使用される AMQP クライアントオプション Bean の名前 タイプ: _string_

source: The name of the AsciiDoc source file that you want to redirect to, without the `.adoc` file extension.
ja_jp: リダイレクト先の AsciiDoc ソースファイルの名前 (`.adoc` ファイル拡張子なし)。

source: The name of the ClusterRole resource to use. Role resources are namespace-based and hence not allowed in ClusterRoleBinding resources.
ja_jp: 使用するClusterRoleリソースの名前です。Roleリソースは名前空間ベースであるため、ClusterRoleBindingリソースでは使用できません。

source: The name of the DLQ; if not supplied will default to the queue name with '.dlq' appended Type: _string_
ja_jp: DLQ の名前。指定しない場合、デフォルトは キューの名前に .dlq を追加したものになります。 Type: _string_

source: The name of the RabbitMQ Credentials Provider bean used to provide dynamic credentials to the RabbitMQ client Type: _string_
ja_jp: RabbitMQ クライアントに動的クレデンシャルを提供するために使用される RabbitMQ クレデンシャルプロバイダー Bean の名前 Type: _string_

source: The name of the binding is only used for the purposes of the Dev Services configuration and is not part of the binding defined in RabbitMQ.
ja_jp: バインディングの名前は、Dev Services の設定のためにのみ使用され、RabbitMQ で定義されたバインディングの一部ではありません。

source: The name of the extension as recognized in the Dev UI.
ja_jp: Dev UI で認識されるエクステンションの名前。

source: The name of the feature should only contain lowercase characters, words are separated by dash; e.g. `security-jpa`. An extension should provide at most one feature and the name must be unique. If multiple extensions register a feature of the same name the build fails.
ja_jp: フィーチャー名には小文字のみを使用し、単語はダッシュで区切ります。例： `security-jpa` 。1 つのエクステンションが提供するフィーチャーは最大でも 1 つで、その名前は一意でなければなりません。複数のエクステンションが同じ名前のフィーチャーを登録した場合、ビルドは失敗します。

source: The name of the field (not the class name) will determine the name of the properties that are bound to the object.
ja_jp: フィールドの名前 (クラス名ではありません) は、オブジェクトにバインドされるプロパティーの名前を決定します。

source: The name of the fragment is derived from the annotated member name. The part before the last occurrence of a dollar sign `$` is the method name of the related type-safe template. The part after the last occurrence of a dollar sign is the fragment identifier. The strategy defined by the relevant `CheckedTemplate#defaultName()` is honored when constructing the defaulted names.
ja_jp: フラグメントの名前は、アノテーションが付けられたメンバー名から導出されます。最後のドル記号 `$` の前の部分は、関連するタイプセーフなテンプレートのメソッド名です。最後のドル記号の後の部分はフラグメント識別子です。関連する `CheckedTemplate#defaultName()` で定義されたストラテジーは、デフォルト名を構築する際に適用されます。

source: The name of the generated init container is `wait-for-${task name}` by default. Given that the init container is part of the same pod as the actual application it will get the same service account (and therefore permissions) and volumes as the application. Further customization to the container can be done using using the configuration options for init containers (see `quarkus.kubernetes.init-containers` or `quarkus.openshift.init-containers`).
ja_jp: 生成される init コンテナの名前は、デフォルトでは `wait-for-${task name}` です。 init コンテナは実際のアプリケーションと同じポッドの一部であるため、アプリケーションと同じサービスアカウント (およびパーミッション) とボリュームを取得します。 init コンテナの設定オプションを使用することで、コンテナをさらにカスタマイズすることができます ( `quarkus.kubernetes.init-containers` または `quarkus.openshift.init-containers` を参照ください)。

source: The name of the generated init container is `wait-for-${task name}` by default. Given that the init container is part of the same pod as the actual application, it will get the same service account (and therefore permissions) and volumes as the application. Further customization to the container can be done using the configuration options for init containers (see `quarkus.kubernetes.init-containers` or `quarkus.openshift.init-containers`).
ja_jp: 生成されるinitコンテナの名前は、デフォルトでは `wait-for-${task name}` です。initコンテナは実際のアプリケーションと同じポッドの一部であるため、アプリケーションと同じサービスアカウント（したがってパーミッション）とボリュームを取得します。init コンテナの設定オプションを使用して、コンテナをさらにカスタマイズすることができます ( `quarkus.kubernetes.init-containers` または `quarkus.openshift.init-containers` を参照)。

source: The name of the link. If not set, the channel name is used. Type: _string_
ja_jp: リンクの名前。設定されていない場合、チャネル名が使用されます。 タイプ: _string_

source: The name of the original AsciiDoc source file that you are retiring, without the `.adoc` file extension.
ja_jp: 廃止する元の AsciiDoc ソースファイルの名前 (`.adoc` ファイル拡張子なし)。

source: The name of the resource is determined by the application name and may be overridden by `quarkus.kubernetes.name`, `quarkus.openshift.name` and `quarkus.knative.name`.
ja_jp: リソースの名前はアプリケーション名によって決定され、 `quarkus.kubernetes.name` 、 `quarkus.openshift.name` 、 `quarkus.knative.name` で上書きすることができます。

source: The name of the target application
ja_jp: 対象となるアプリケーションの名前

source: The name of the template is derived from the resource class and method name; `DetailResource/item` in this particular case.
ja_jp: テンプレートの名前は、リソースクラスとメソッド名から派生しています。このケースでは、`DetailResource/item` です。

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.DeserializationFailureHandler`. If set, deserialization failure happening when deserializing keys are delegated to this handler which may retry or provide a fallback value. Type: _string_
ja_jp: `io.smallrye.reactive.messaging.kafka.DeserializationFailureHandler` を実装する Beanの `@Identifier` で設定された名前です。設定されている場合、キーをデシリアライズする際に起こるデシリアライズの失敗は、フォールバック値を再試行または提供することができるこのハンドラに委ねられます。 Type: _string_

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.DeserializationFailureHandler`. If set, deserialization failure happening when deserializing values are delegated to this handler which may retry or provide a fallback value. Type: _string_
ja_jp: `io.smallrye.reactive.messaging.kafka.DeserializationFailureHandler` を実装する Beanの `@Identifier` で設定された名前です。設定されている場合、値をデシリアライズする際に起こるデシリアライズの失敗は、フォールバック値を再試行または提供することができるこのハンドラに委ねられます。 Type: _string_

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener`. If set, this rebalance listener is applied to the consumer. Type: _string_
ja_jp: `io.smallrye.reactive.messaging.kafka.KafkaConsumerRebalanceListener` を実装する Bean の `@Identifier` で設定された名前です。設定された場合、このリバランスリスナーはコンシューマーに適用されます。 Type: _string_

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.SerializationFailureHandler`. If set, serialization failure happening when serializing keys are delegated to this handler which may provide a fallback value. Type: _string_
ja_jp: `io.smallrye.reactive.messaging.kafka.SerializationFailureHandler` を実装する Bean の `@Identifier` で設定された名前です。設定されている場合、キーをシリアライズする際に起こるシリアライズの失敗は、フォールバック値を再試行または提供することができるこのハンドラに委ねられます。 Type: _string_

source: The name set in `@Identifier` of a bean that implements `io.smallrye.reactive.messaging.kafka.SerializationFailureHandler`. If set, serialization failure happening when serializing values are delegated to this handler which may provide a fallback value. Type: _string_
ja_jp: `io.smallrye.reactive.messaging.kafka.SerializationFailureHandler` を実装する Bean の `@Identifier` で設定された名前です。設定されている場合、値をシリアライズする際に起こるシリアライズの失敗は、フォールバック値を再試行または提供することができるこのハンドラに委ねられます。 Type: _string_

source: The name, description and unit of the metric you defined in the constructor of the `HistogramResource` class.
ja_jp: `HistogramResource` クラスのコンストラクターで定義したメトリクスの名前、説明、および単位。

source: The name, description and unit of the metric you defined in the constructor of the `MetricResource` class.
ja_jp: `MetricResource` クラスのコンストラクターで定義したメトリクスの名前、説明、および単位。

source: The names of the handlers that you want to attach to a specific category.
ja_jp: 特定のカテゴリにアタッチしたいハンドラーの名前です。

source: The native compiler does not support everything that is possible to do in Java. There are cases not yet supported, and Avro is using some of these unsupported constructs. Fortunately, we can implement _substitutions_ (to replace unsupported constructs in the code directly) and use Quarkus extensions to configure the compiler correctly. As a result, your application does not have to configure anything, "it just works™️".
ja_jp: ネイティブコンパイラは、Javaでできることをすべてサポートしているわけではありません。 まだサポートされていないケースがあり、Avroではこれらのサポートされていない構文のいくつかを使用しています。幸いなことに、_substitutions_(コード内のサポートされていない構文を直接置き換える)を実装し、Quarkusのエクステンションを使用してコンパイラを正しく設定することができます。その結果、アプリケーションは何も設定する必要がなく、「it just works™️」。

source: The native executable does not include the logging implementation for those APIs. Use JBoss Logging adapters to resolve this issue.
ja_jp: ネイティブ実行可能ファイルには、それらの API 用のロギング実装が含まれていません。この問題を解決するには、JBoss Logging アダプターを使用してください。

source: The native executable for our application will contain the application code, required libraries, Java APIs, and a reduced version of a VM. The smaller VM base improves the startup time of the application and produces a minimal disk footprint.
ja_jp: アプリケーションのネイティブ実行可能ファイルには、アプリケーション・コード、必要なライブラリ、Java API、および VM の縮小版が含まれます。VM ベースが小さくなることで、アプリケーションの起動時間が改善され、ディスクフットプリントが最小限に抑えられます。

source: The native executable must be referenced as `runner` if you include a custom `bootstrap` script.
ja_jp: カスタム `bootstrap` スクリプトを含む場合は、ネイティブ実行可能ファイルを `runner` として参照する必要があります。

source: The native executable requires some additional steps to enable client SSL that S3 and other AWS libraries need.
ja_jp: ネイティブ実行可能ファイルは、S3 や他の aws ライブラリーが必要とするクライアント SSL を有効にするために、いくつかの追加の手順が必要です。

source: The native executable tests will fail with the following error:
ja_jp: ネイティブ実行可能ファイルのテストは、以下のエラーで失敗します:

source: The native executable will be specific to your operating system. To create an executable that will run in a container, use the following:
ja_jp: ネイティブ実行可能ファイルは、お使いのオペレーティングシステムに固有のものになります。コンテナー内で実行される実行ファイルを作成するには、次のようにします。
